---
kind: other
id: Properties.T:Autodesk.Revit.DB.SaveOptions
source: html/0abb89a0-e5ae-95c8-71c3-3f7e89cedfc4.htm
---
# SaveOptions Properties

Default is false: let the OS eliminate as much or as little dead data as it wants to.
 True: force the OS to eliminate all dead data from the file on disk.